@echo off
chcp 65001
title Git一键推送GitHub

:: 判断是否传入提交备注
if "%~1"=="" (
    echo ======================================
    echo  使用方式:
    echo  git_push.bat 提交备注
    echo  示例: git_push.bat 新增笔记 优化代码
    echo ======================================
    pause
    exit /b
)

echo ======================================
echo 1. 拉取远程最新代码
echo ======================================
git pull

echo.
echo ======================================
echo 2. 添加所有变更文件
echo ======================================
git add .

echo.
echo ======================================
echo 3. 本地提交
echo 提交信息：%*
echo ======================================
git commit -m "%*"

echo.
echo ======================================
echo 4. 推送到 GitHub
echo ======================================
git push

echo.
echo ======================================
echo 操作完成
echo ======================================
pause